In [35]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [15]:
df.dropna(axis=0)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [12]:
df

       name        toy       born
0    Alfred        NaT        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [6]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [16]:
df.dropna(how='all')#any or all

       name        toy       born
0    Alfred        NaT        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [30]:
#Keep only the rows with at least 2 non-NA values.

df.dropna(thresh=2,axis=0)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [31]:
#Define in which columns to look for missing values.

df.dropna(subset=['born'])

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [32]:
#Keep the DataFrame with valid entries in the same variable.

df.dropna(inplace=True)
df

       name        toy       born
0    Alfred        NaT        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [41]:
df.notna()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False